[net]
# Testing
batch=32
subdivisions=2
# Training
# batch=64
# subdivisions=8
height=416
width=416
channels=3
momentum=0.5
decay=0.0005
angle=0
saturation = 1.5
exposure = 1.5
hue=.1

learning_rate=0.01
burn_in=1000
max_batches = 88200
policy=steps
steps=-1,500,40000,60000
scales=0.1,5,.1,.1

[convolutional]
batch_normalize=1
filters=32
size=3
stride=1
pad=1
activation=leaky

[maxpool]
size=2
stride=2

[convolutional]
batch_normalize=1
filters=64
size=3
stride=1
pad=1
activation=leaky

[maxpool]
size=2
stride=2

[convolutional]
batch_normalize=1
filters=128
size=3
stride=1
pad=1
activation=leaky

[convolutional]
batch_normalize=1
filters=64
size=1
stride=1
pad=1
activation=leaky

[convolutional]
batch_normalize=1
filters=128
size=3
stride=1
pad=1
activation=leaky

[maxpool]
size=2
stride=2

[convolutional]
batch_normalize=1
filters=512
size=3
stride=1
pad=1
activation=leaky

[convolutional]
batch_normalize=1
filters=128
size=1
stride=1
pad=1
activation=leaky

[convolutional]
batch_normalize=1
filters=512
size=3
stride=1
pad=1
activation=leaky

[maxpool]
size=2
stride=2

[convolutional]
batch_normalize=1
filters=128
size=3
stride=1
pad=1
activation=leaky


[convolutional]
batch_normalize=1
filters=256
size=1
stride=1
pad=1
activation=leaky

[convolutional]
batch_normalize=1
filters=128
size=3
stride=1
pad=1
activation=leaky


[maxpool]
size=2
stride=2


#iv-1
[convolutional]
batch_normalize=1
filters=256
size=3
stride=1
pad=1
activation=leaky

#iv-1
[convolutional]
batch_normalize=1
filters=128
size=3
stride=1
pad=1
activation=leaky


#iv-1
[convolutional]
batch_normalize=1
filters=256
size=3
stride=1
pad=1
activation=leaky


#iv-1
[convolutional]
batch_normalize=1
filters=128
size=3
stride=1
pad=1
activation=leaky

[upsample]
scale=2
#add a layer so the route may be earlier
[route]
layers=-1,-9

#iv-1
[convolutional]
batch_normalize=1
filters=512
size=1
stride=1
pad=1
activation=leaky

#iv-1
[convolutional]
batch_normalize=1
filters=256
size=3
stride=1
pad=1
activation=leaky

#iv-1
[convolutional]
batch_normalize=1
filters=128
size=3
stride=1
pad=1
activation=leaky

[convolutional]
size=1
stride=1
pad=1
# 5*(5 + num_class)
filters=30
activation=linear

[region]
anchors =  1.25,1.75,1.053,2.8436,2.875,3.374, 4.934,2.536, 8.8092,8.1468
# anchors =  0.625,0.875, 1.4375,1.6875, 2.3125,3.625
bias_match=1
classes=1
coords=4
num=5
softmax=1
jitter=.3
rescore=1

object_scale=5
noobject_scale=1
class_scale=1
coord_scale=1

absolute=1
thresh = .6
random=1